[
  {
    "id": 6541,
    "role": "Backend DevOps Engineer - Telefónica",
    "company": "BCNC GROUP",
    "location": "Barcelona, Spain",
    "start_date": "2025-03-01",
    "end_date": "2025-08-15",
    "current": false,
    "summary": "Contribution to several projects as DevOps and Backend Developer.",
    "description": "Contribution to several projects as DevOps and Backend Developer. Design and maintenance of CI/CD pipelines with GitHub Actions and deployments on Kubernetes using Helm. Backend services development in Kotlin with Spring Boot and DDD (Hexagonal) architecture."
  },
  {
    "id": 3032,
    "role": "Full Stack Developer (DOME Marketplace)",
    "company": "IN2 Ingeniería de la Información",
    "location": "Barcelona, Spain",
    "start_date": "2024-09-01",
    "end_date": "2025-02-01",
    "current": false,
    "summary": "Development of a European marketplace for cloud services (SaaS).",
    "description": "Development of a marketplace for Cloud & Edge services (EU). Backend in Java 17 + Spring Boot 3 and frontend with AngularJS. CI/CD orchestration in Kubernetes with GitHub Flow."
  },
  {
    "id": 7188,
    "role": "Mobile Developer (IDEP / EUDI Wallet)",
    "company": "IN2 Ingeniería de la Información",
    "location": "Barcelona, Spain",
    "start_date": "2024-04-01",
    "end_date": "2024-08-01",
    "current": false,
    "summary": "Migration of a native application to Kotlin/Jetpack Compose and preparation for mobile launch.",
    "description": "Leadership in migrating a native app to Kotlin/Jetpack Compose. Implementation of MVVM architecture and coordination of mobile deployment. Documentation management for publishing on iOS and Android."
  },
  {
    "id": 9772,
    "role": "Backend Developer (IDEP)",
    "company": "IN2 Ingeniería de la Información",
    "location": "Barcelona, Spain",
    "start_date": "2023-09-01",
    "end_date": "2024-08-01",
    "current": false,
    "summary": "Development of a verifiable credentials solution aligned with OpenID4VC.",
    "description": "Development of a verifiable credentials solution according to OPENID4VC. Design of microservices in Java/Kotlin with Spring Boot 3. Deployment in cloud environment with Azure DevOps."
  },
  {
    "id": 9213,
    "role": "Junior Backend Developer",
    "company": "GFT IT Consulting, S.L.",
    "location": "Sant Cugat del Vallès, Spain",
    "start_date": "2021-11-14",
    "end_date": "2023-09-15",
    "current": false,
    "summary": "Development of microservices in Java and API documentation.",
    "description": "Development of microservices in Java with Spring and SpringBoot. Development of some functions in the architecture of different applications. REST API documentation using Swagger. Version control with Git and the GitFlow standard. Agile methodology using SCRUM."
  }
]
